start_message_member = """⌔︙أهلآ بك في بوت {فاست}
⌔︙اختصاص البوت حماية المجموعات
⌔︙لتفعيل البوت عليك اتباع مايلي ...
⌔︙اضف البوت الى مجموعتك
⌔︙ارفعه ادمن 
⌔︙ليتم تفعيل المجموعة تلقائيا
⌔︙معرف البوت ← @{bot_username}
⌔︙مطور البوت ← @{dev_username}"""


copy_right = """
# The idea and the code was done by Mody Elhyba
# Tele: @elhyba
# Before using anything, please mention the source, all rights reserved
"""
Welcome_message = """• مرحبا بك في قسم رساله الترحيب  🌾
- ستظهر هذه الرساله عند ارسال (اي رسالة) الى البوت الخاص بك 

- ارساله الحاليه : {msg}"""

message_for_admin = "هلا مطور!"


Compulsory_subscription_letter_dep = """• مرحبا بك في قسم الاشتراك الاجباري 💫

- قناة الاشتراك الاساسية : {a}  ! 
- رساله الاشتراك الاساسية : {b}"""

sign_chanell_message = """• قم برفع البوت ادمن في قناتك اولا 🌟

• من ثم ارسال معرف او ايدي القناة او قم بعمل توجيه لاي منشور من قناتك الى البوت"""

Compulsory_subscription_letter = "⌔︙عليك الاشتراك في قناة البوت لأستخدام الاوامر🚀."


InformationChannelreply = """اهلا بك في قسم تعيين قناه:
يمكنك اضافه قناه للتحكم في الردود - اضافه - مسح - عرض - مسح الكل

لإضافة رد عام من خلال قناتك ارسل رساله هكذا:    اسم الرد : قيمه الرد
مع الاخذ بنظر الاعتبار ان في حال ادخل نفس اسم الرد و قيمه جديده للرد سيتم اضافتها مع القيمة الجديدة 
مثال: احمد : اهلا بك,
احمد : اهلا بك مجددا,
أي سيكون لاسم الرد "احمد" قيمتان هما: اهلا بك + اهلا بك مجددا, و القيمة الراجعة ستكون قيمه عشوائية!

لمسح رد عام من خلال قناتك, قم بالرد على رساله تحوي اسم الرد و قيمته بكلمه "مسح"

لمسح جميع الردود ارسل رساله "مسح الردود"

لعرض قيمه رد ما, ارسل "عرض" + اسم الرد,
مثال: عرض احمد."""


msgCmd = """

✯︙ اهلا بك عزيزي في قائمة الاوامر ✓
"""

M1 = """

            
⩹━⛥━𝗦𝗢𝗨𝗥𝗖𝗘 𝗦𝗡𝗜𝗣𝗘𝗥━★━⩺

 اوامر الطرد والحظر :

╮  تقييد 
│ حظر 
│ طرد 
│ كتم
│ طرد البوتات 
│ الغاء الحظر 
│ الغاء الكتم
╯ الغاء التقييد 

اوامر الرفع و تنزيل:
 
╮  رفع مالك
│ رفع ادمن
│ تنزيل مالك
╯ تنزيل ادمن

 لظهار قوائم:
 
╮ قائمة المكتومين
│ قائمة المحظورين
│ قائمة المقيدين
│ قائمة المالكين
╯  قائمة الادمنيه

اوامر المسح :

╮  مسح الادمنيه
│ مسح المحظورين
│ مسح المكتومين
│ مسح القيدين
│ مسح المالكين
╯ مسح الادمنيه

⩹━⛥━𝗦𝗢𝗨𝗥𝗖𝗘 𝗦𝗡𝗜𝗣𝗘𝗥━★━⩺
"""

M2 = """
 

⩹━⛥━𝗦𝗢𝗨𝗥𝗖𝗘 𝗦𝗡𝗜𝗣𝗘𝗥━★━⩺
       
⦿  **اليك قائمة اوامر التشغيل في الجروب**

╮  لتشغيل اغنيه  : تشغيل او شغل او /play
│ لتشغيل فيديو  : /vplay او فيديو او فديو
│ لأنهاء الاغنيه  : انهاء او اسكت او ايقاف /end
│ لايقاف الاغنيه مؤقت  : وقف او توقف او /pause
│ لتكملة الاغنيه من الايقاف المؤقت : كمل او استئناف 
│ لتخطي الاغنيه  : تخطي او /skip
│ لكتم البوت في الكول  : ميوت او /mute
│ لألغاء كتم البوت في الكول  : فك ميوت او /unmute
│ لاعادة تشغيل البوت  : ريستارت او /restart 
│ لمعرفه كلمات اي اغنيه : /lyrics او كلمات
│ لتحميل موسيقي او فيديو : /song او تحميل او اغنيه
╯ لمعرفه الاغاني الموجوده في قائمه الانتظار : /queue

⩹━⛥━𝗦𝗢𝗨𝗥𝗖𝗘 𝗦𝗡𝗜𝗣𝗘𝗥━★━⩺

"""

M3 = """
 

⩹━⛥━𝗦𝗢𝗨𝗥𝗖𝗘 𝗦𝗡𝗜𝗣𝗘𝗥━★━⩺
       
اوامر القفل و الفتح للحمايه:

╮ ⇐الصور
│
│⇐  الروابط
│
│⇐  السب
│
│⇐  التوجيه
│
│⇐  الفيديو
│
│⇐  التثبيت 
│
│⇐  الكل
│
│⇐  الملصقات
│
│⇐  الايدي
│
│⇐  جمالي
│
│⇐  الحظر
│
│⇐  الكتم
│
│⇐ البايو
│
│⇐ الدعوه
│
│⇐ المتحركات
│
│⇐ الاباحي
│
╯ ⇐ التقيد
⩹━⛥━𝗦𝗢𝗨𝗥𝗖𝗘 𝗦𝗡𝗜𝗣𝗘𝗥━★━⩺

"""

M5 = """
 
- (الالعاب) .

- تفعيل الالعاب .
- تعطيل الالعاب .
- كت , كت تويت


- (اوامر الزواج) .

- زواج - بالرد - عشان تتزوج  
- طلاق - بالرد - عشان تطلقها 
- خلع - بالرد - عشان تطلقك  

"""

M4 = """

- (اليوتيوب) .

- تفعيل اليوتيوب .
- تعطيل اليوتيوب .

- (البحث والتحميل) .

- يوت اسم الاغنية .
- بحث اسم الاغنية او الفيديو .

"""


M6 = """

⩹━⛥━𝗦𝗢𝗨𝗥𝗖𝗘 𝗦𝗡𝗜𝗣𝗘𝗥━★━⩺ 

╮⫢ **اوامر تشغيل البوت في القناه:**
╯⦿ **قم برفع البوت مشرف بالقناه:** 

╮⦿  استخدم /channelplay او ربط + معرف القناه للربط
│᚜⦿ لتشغيل اغنيه  : **تشغيل او شغل** او /play
│᚜⦿ لتشغيل فيديو  : /vplay : فيديو : فديو
│᚜⦿ لأنهاء الاغنيه  : **ايقاف او اسكت** او /end
│᚜⦿ لايقاف الاغنيه مؤقت : **وقف او توقف** او /pause
│᚜⦿ لستكمال الاغنيه متوقفه فالكول :**كمل** او /resume
│᚜⦿ لتخطي الاغنيه  : **تخطي** او /skip
│᚜⦿ لكتم البوت في  : **اكتم او** /mute
│᚜⦿ لألغاء كتم البوت  : **فك ميوت او** /unmute
│᚜⦿ **لتشغيل اغنيه** : /cplay
│᚜⦿ **لتشغيل فيديو** : /cvplay
│᚜⦿ **لأنهاء الاغنيه**  : /cstop
│᚜⦿ **لايقاف الاغنيه مؤقت** : /cpause
│᚜⦿ **لتكملة الاغنيه**  : /cresume
│᚜⦿ **لتخطي الاغنيه** : /cskip
│᚜⦿ **لكتم البوت في الكول**  : /cmute
│᚜⦿ **لألغاء كتم البوت في الكول**  :  /cunmute
╯⦿  **لتقديم الاغنيه للامام **/seek و الرقم

⩹━⛥━𝗦𝗢𝗨𝗥𝗖𝗘 𝗦𝗡𝗜𝗣𝗘𝗥━★━⩺

"""


KitList = [
    "اخر افلام شاهدتها",
    "ما هيا عيوب  ؟ ",
    " هل بتكراش ع حد في حياتك؟",
    " ينفع نرتبط؟",
    " ممكن توريني صوره بتحبها؟",
    " ممكن نبقي صحااب ع الفيس؟",
    "عندك كام اكس في حياتك؟ ",
    "ينفع تبعتلي رقمك؟ ",
    " ما تيجي اعزمني ع حاجه بحبها؟",
    "ينفع احضنك؟ ",
    "قولي ع اكبر غلطه ندمان عليهاا؟ ",
    "عندك كام سنه؟ ",
    " عامل بلوك لكام واحد عندك؟",
    " قولي سر محدش يعرفه؟",
    " عندك كام اكس في حياتك؟",
    "بتعرف تقلش وتهزر؟ ",
    " لونك المفضل هو؟",
    "كتابك المفضل",
    "هوايتك المفضله",
    "علاقتك مع اهلك",
    " ما السيء في هذه الحياة ؟ ",
    "أجمل شيء حصل معك خلال هذا الاسبوع ؟ ",
    "سؤال ينرفزك ؟ ",
    " هل يعجبك  ؟؟ ",
    " اكثر ممثل تحبه ؟ ",
    "قد تخيلت شي في بالك وصار ؟ ",
    "شيء عندك اهم من الناس ؟ ",
    "تفضّل النقاش الطويل او تحب الاختصار ؟ ",
    "وش أخر شي ضيعته؟ ",
    "اي رايك في  ؟ ",
    "كم مره حبيت؟ ",
    " اكثر المتابعين عندك باي برنامج؟",
    " اخر مره ضربت عشره كانت متى ؟",
    " نسبه الندم عندك للي وثقت فيهم ؟",
    "تحب ترتبط بكيرفي ولا فلات؟",
    " جربت شعور احد يحبك بس انت مو قادر تحبه؟",
    " تجامل الناس ولا اللي بقلبك على لسانك؟",
    " عمرك ضحيت باشياء لاجل شخص م يسوى ؟",
    "مغني تلاحظ أن صوته يعجب الجميع إلا أنت؟ ",
    " اخر غلطات عمرك؟ ",
    " مسلسل كرتوني له ذكريات جميلة عندك؟ ",
    " ما أكثر تطبيق تقضي وقتك عليه؟ ",
    " أول شيء يخطر في بالك إذا سمعت كلمة نجوم ؟ ",
    " قدوتك من الأجيال السابقة؟ ",
    " أكثر طبع تهتم بأن يتواجد في شريك/ة حياتك؟ ",
    "أكثر حيوان تخاف منه؟ ",
    " ما هي طريقتك في الحصول على الراحة النفسية؟ ",
    " إيموجي يعبّر عن مزاجك الحالي؟ ",
    " أكثر تغيير ترغب أن تغيّره في نفسك؟ ",
    "أكثر شيء أسعدك اليوم؟ ",
    "اي رايك في الدنيا دي ؟ ",
    "ما هو أفضل حافز للشخص؟ ",
    "ما الذي يشغل بالك في الفترة الحالية؟",
    "اخر شيء ندمت عليه؟ ",
    "شاركنا صورة احترافية من تصويرك؟ ",
    "تتابع انمي؟ إذا نعم ما أفضل انمي شاهدته ",
    "يرد عليك متأخر على رسالة مهمة وبكل برود، موقفك؟ ",
    "نصيحه تبدا ب -لا- ؟ ",
    "كتاب أو رواية تقرأها هذه الأيام؟ ",
    "فيلم عالق في ذهنك لا تنساه مِن روعته؟ ",
    "يوم لا يمكنك نسيانه؟ ",
    "شعورك الحالي في جملة؟ ",
    "كلمة لشخص بعيد؟ ",
    "صفة يطلقها عليك الشخص المفضّل؟ ",
    "أغنية عالقة في ذهنك هاليومين؟ ",
    "أكلة مستحيل أن تأكلها؟ ",
    "كيف قضيت نهارك؟ ",
    "تصرُّف ماتتحمله؟ ",
    "موقف غير حياتك؟ ",
    "اكثر مشروب تحبه؟ ",
    "القصيدة اللي تأثر فيك؟ ",
    "متى يصبح الصديق غريب ",
    "وين نلقى السعاده برايك؟ ",
    "تاريخ ميلادك؟ ",
    "قهوه و لا شاي؟ ",
    "من محبّين الليل أو الصبح؟ ",
    "حيوانك المفضل؟ ",
    "كلمة غريبة ومعناها؟ ",
    "كم تحتاج من وقت لتثق بشخص؟ ",
    "اشياء نفسك تجربها؟ ",
    "يومك ضاع على؟ ",
    "كل شيء يهون الا ؟ ",
    "اسم ماتحبه ؟ ",
    "وقفة إحترام للي إخترع ؟ ",
    "أقدم شيء محتفظ فيه من صغرك؟ ",
    "كلمات ماتستغني عنها بسوالفك؟ ",
    "وش الحب بنظرك؟ ",
    "حب التملك في شخصِيـتك ولا ؟ ",
    "تخطط للمستقبل ولا ؟ ",
    "موقف محرج ماتنساه ؟ ",
    "من طلاسم لهجتكم ؟ ",
    "اعترف باي حاجه ؟ ",
    "عبّر عن مودك بصوره ؟ ",
    "اخر مره ضربت عشره كانت متى ؟",
    "اسم دايم ع بالك ؟ ",
    "اشياء تفتخر انك م سويتها ؟ ",
    " لو بكيفي كان ؟ ",
    "أكثر جملة أثرت بك في حياتك؟ ",
    "إيموجي يوصف مزاجك حاليًا؟ ",
    "أجمل اسم بنت بحرف الباء؟ ",
    "كيف هي أحوال قلبك؟ ",
    "أجمل مدينة؟ ",
    "كيف كان أسبوعك؟ ",
    "شيء تشوفه اكثر من اهلك ؟ ",
    "اخر مره فضفضت؟ ",
    "قد كرهت احد بسبب اسلوبه؟ ",
    "قد حبيت شخص وخذلك؟ ",
    "كم مره حبيت؟ ",
    "اكبر غلطة بعمرك؟ ",
    "نسبة النعاس عندك حاليًا؟ ",
    "شرايكم بمشاهير التيك توك؟ ",
    "ما الحاسة التي تريد إضافتها للحواس الخمسة؟ ",
    "اسم قريب لقلبك؟ ",
    "مشتاق لمطعم كنت تزوره قبل الحظر؟ ",
    "ما أول مشروع تتوقع أن تقوم بإنشائه إذا أصبحت مليونير؟ ",
    "أغنية عالقة في ذهنك هاليومين؟ ",
    "متى اخر مره قريت قران؟ ",
    "لو عشقك مطوري تقبل؟ ",
]
